{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "**Алгоритм обучения методом градиентного спуска**\n",
        "\n",
        "Будем использовать базу данных MNIST, которая включает 60,000 изображений для обучения и 10,000 изображений для тестирования\n",
        "\n",
        "Для активации нейронов выходного слоя используется сигмоидальная функция, что позволяет интерпретировать выходные данные как вероятности принадлежности входного изображения к одной из десяти категорий.\n",
        "\n",
        "Параметры обучения:\n",
        "- установленная скорость обучения составляет 0.1;\n",
        "- процесс обучения длится 20 эпох.\n"
      ],
      "metadata": {
        "id": "k0-S14qtCH-k"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import numpy as np\n",
        "from tensorflow.keras.datasets import mnist\n",
        "\n",
        "# Функция активации (сигмоида)\n",
        "def sigmoid(x):\n",
        "    return 1 / (1 + np.exp(-x))\n",
        "\n",
        "# Производная функции активации (сигмоида)\n",
        "def sigmoid_derivative(x):\n",
        "    return sigmoid(x) * (1 - sigmoid(x))\n",
        "\n",
        "# Подготовка данных\n",
        "(x_train, y_train), (x_test, y_test) = mnist.load_data()\n",
        "\n",
        "# Нормализация данных\n",
        "x_train = x_train / 255.0\n",
        "x_test = x_test / 255.0\n",
        "\n",
        "# Преобразование меток в категориальный формат\n",
        "num_classes = 10\n",
        "y_train = np.eye(num_classes)[y_train]\n",
        "y_test = np.eye(num_classes)[y_test]\n",
        "\n",
        "# Преобразование изображений в векторы\n",
        "x_train = x_train.reshape(x_train.shape[0], -1)\n",
        "x_test = x_test.reshape(x_test.shape[0], -1)\n",
        "\n",
        "# Инициализация весов и смещений\n",
        "np.random.seed(42)\n",
        "input_dim = x_train.shape[1]\n",
        "output_dim = num_classes\n",
        "weights = np.random.randn(input_dim, output_dim) * 0.01\n",
        "biases = np.random.randn(output_dim) * 0.01\n",
        "\n",
        "# Параметры обучения\n",
        "learning_rate = 0.1\n",
        "epochs = 20\n",
        "\n",
        "# Списки для хранения значений ошибок и точности\n",
        "training_errors = []\n",
        "test_accuracies = []\n",
        "\n",
        "# Обучение\n",
        "for epoch in range(epochs):\n",
        "    total_error = 0\n",
        "    for i in range(x_train.shape[0]):\n",
        "        # Входные данные и целевые значения\n",
        "        X = x_train[i]\n",
        "        D = y_train[i]\n",
        "\n",
        "        # Вычисление выходов нейронов\n",
        "        net = np.dot(X, weights) + biases\n",
        "        Y = sigmoid(net)\n",
        "\n",
        "        # Вычисление ошибки\n",
        "        error = D - Y\n",
        "        total_error += np.sum(error**2) / 2\n",
        "\n",
        "        # Обновление весов и смещений\n",
        "        delta = error * sigmoid_derivative(net)\n",
        "        weights += learning_rate * np.outer(X, delta)\n",
        "        biases += learning_rate * delta\n",
        "\n",
        "    # Сохранение ошибки на текущей эпохе\n",
        "    training_errors.append(total_error)\n",
        "\n",
        "    # Оценка модели на тестовых данных\n",
        "    correct_predictions = 0\n",
        "    for i in range(x_test.shape[0]):\n",
        "        X = x_test[i]\n",
        "        D = y_test[i]\n",
        "        net = np.dot(X, weights) + biases\n",
        "        Y = sigmoid(net)\n",
        "        if np.argmax(Y) == np.argmax(D):\n",
        "            correct_predictions += 1\n",
        "\n",
        "    accuracy = correct_predictions / x_test.shape[0]\n",
        "    test_accuracies.append(accuracy)\n",
        "\n",
        "    print(f'Эпоха {epoch+1}/{epochs}, Ошибка: {total_error:.4f}, Точность: {accuracy:.4f}')\n",
        "\n",
        "# Финальная оценка модели на тестовых данных\n",
        "correct_predictions = 0\n",
        "for i in range(x_test.shape[0]):\n",
        "    X = x_test[i]\n",
        "    D = y_test[i]\n",
        "    net = np.dot(X, weights) + biases\n",
        "    Y = sigmoid(net)\n",
        "    if np.argmax(Y) == np.argmax(D):\n",
        "        correct_predictions += 1\n",
        "\n",
        "accuracy = correct_predictions / x_test.shape[0]\n",
        "print(f'Финальная точность: {accuracy:.4f}')\n",
        "\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "R6U2OGUxkQ4w",
        "outputId": "004692b3-9a57-4d7d-d624-8d558eb01251"
      },
      "execution_count": 3,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Downloading data from https://storage.googleapis.com/tensorflow/tf-keras-datasets/mnist.npz\n",
            "\u001b[1m11490434/11490434\u001b[0m \u001b[32m━━━━━━━━━━━━━━━━━━━━\u001b[0m\u001b[37m\u001b[0m \u001b[1m0s\u001b[0m 0us/step\n",
            "Эпоха 1/20, Ошибка: 6047.4701, Точность: 0.8981\n",
            "Эпоха 2/20, Ошибка: 5093.1303, Точность: 0.9057\n",
            "Эпоха 3/20, Ошибка: 4891.0661, Точность: 0.9093\n",
            "Эпоха 4/20, Ошибка: 4777.9680, Точность: 0.9114\n",
            "Эпоха 5/20, Ошибка: 4701.3935, Точность: 0.9133\n",
            "Эпоха 6/20, Ошибка: 4644.4111, Точность: 0.9144\n",
            "Эпоха 7/20, Ошибка: 4599.1678, Точность: 0.9147\n",
            "Эпоха 8/20, Ошибка: 4561.8564, Точность: 0.9146\n",
            "Эпоха 9/20, Ошибка: 4530.2366, Точность: 0.9145\n",
            "Эпоха 10/20, Ошибка: 4502.8814, Точность: 0.9151\n",
            "Эпоха 11/20, Ошибка: 4478.8104, Точность: 0.9151\n",
            "Эпоха 12/20, Ошибка: 4457.3282, Точность: 0.9153\n",
            "Эпоха 13/20, Ошибка: 4437.9762, Точность: 0.9152\n",
            "Эпоха 14/20, Ошибка: 4420.4260, Точность: 0.9149\n",
            "Эпоха 15/20, Ошибка: 4404.3956, Точность: 0.9147\n",
            "Эпоха 16/20, Ошибка: 4389.6456, Точность: 0.9151\n",
            "Эпоха 17/20, Ошибка: 4375.9821, Точность: 0.9155\n",
            "Эпоха 18/20, Ошибка: 4363.2492, Точность: 0.9160\n",
            "Эпоха 19/20, Ошибка: 4351.3214, Точность: 0.9166\n",
            "Эпоха 20/20, Ошибка: 4340.0938, Точность: 0.9162\n",
            "Финальная точность: 0.9162\n"
          ]
        }
      ]
    }
  ]
}